MaJerle/stm32-usart-uart-dma-rx-tx/drivers/CMSIS/Device/ST/STM32C5xx/SVD/STM32C593.svd
        <register>
          <name>ETH_MMC_RX_INTERRUPT</name>
          <displayName>ETH_MMC_RX_INTERRUPT</displayName>
          <description>MMC Rx interrupt register</description>
          <addressOffset>0x0704</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RXCRCERPIS</name>
              <description>MMC Receive CRC Error Packet Counter Interrupt Status</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXALGNERPIS</name>
              <description>MMC Receive Alignment Error Packet Counter Interrupt Status</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXUCGPIS</name>
              <description>MMC Receive Unicast Good Packet Counter Interrupt Status</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXLPIUSCIS</name>
              <description>MMC Receive LPI microsecond counter interrupt status</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXLPITRCIS</name>
              <description>MMC Receive LPI transition counter interrupt status</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ETH_MMC_TX_INTERRUPT</name>
          <displayName>ETH_MMC_TX_INTERRUPT</displayName>
          <description>MMC Tx interrupt register</description>
          <addressOffset>0x0708</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TXSCOLGPIS</name>
              <description>MMC Transmit Single Collision Good Packet Counter Interrupt Status</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXMCOLGPIS</name>
              <description>MMC Transmit Multiple Collision Good Packet Counter Interrupt Status</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXGPKTIS</name>
              <description>MMC Transmit Good Packet Counter Interrupt Status</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXLPIUSCIS</name>
              <description>MMC Transmit LPI microsecond counter interrupt status</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXLPITRCIS</name>
              <description>MMC Transmit LPI transition counter interrupt status</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ETH_MMC_RX_INTERRUPT_MASK</name>
          <displayName>ETH_MMC_RX_INTERRUPT_MASK</displayName>
          <description>MMC Rx interrupt mask register</description>
          <addressOffset>0x070C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RXCRCERPIM</name>
              <description>MMC Receive CRC Error Packet Counter Interrupt Mask</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXALGNERPIM</name>
              <description>MMC Receive Alignment Error Packet Counter Interrupt Mask</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXUCGPIM</name>
              <description>MMC Receive Unicast Good Packet Counter Interrupt Mask</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXLPIUSCIM</name>
              <description>MMC Receive LPI microsecond counter interrupt Mask</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXLPITRCIM</name>
              <description>MMC Receive LPI transition counter interrupt Mask</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ETH_MMC_TX_INTERRUPT_MASK</name>
          <displayName>ETH_MMC_TX_INTERRUPT_MASK</displayName>
          <description>MMC Tx interrupt mask register</description>
          <addressOffset>0x0710</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TXSCOLGPIM</name>
              <description>MMC Transmit Single Collision Good Packet Counter Interrupt Mask</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXMCOLGPIM</name>
              <description>MMC Transmit Multiple Collision Good Packet Counter Interrupt Mask</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXGPKTIM</name>
              <description>MMC Transmit Good Packet Counter Interrupt Mask</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXLPIUSCIM</name>
              <description>MMC Transmit LPI microsecond counter interrupt Mask</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXLPITRCIM</name>
              <description>MMC Transmit LPI transition counter interrupt Mask</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ETH_TX_SINGLE_COLLISION_GOOD_PACKETS</name>
          <displayName>ETH_TX_SINGLE_COLLISION_GOOD_PACKETS</displayName>
          <description>Tx single collision good packets register</description>
          <addressOffset>0x074C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TXSNGLCOLG</name>
              <description>Tx Single Collision Good Packets</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ETH_TX_MULTIPLE_COLLISION_GOOD_PACKETS</name>
          <displayName>ETH_TX_MULTIPLE_COLLISION_GOOD_PACKETS</displayName>
          <description>Tx multiple collision good packets register</description>
          <addressOffset>0x0750</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TXMULTCOLG</name>
              <description>Tx Multiple Collision Good Packets</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ETH_TX_PACKET_COUNT_GOOD</name>
          <displayName>ETH_TX_PACKET_COUNT_GOOD</displayName>
          <description>Tx packet count good register</description>
          <addressOffset>0x0768</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TXPKTG</name>
              <description>Tx Packet Count Good</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ETH_RX_CRC_ERROR_PACKETS</name>
          <displayName>ETH_RX_CRC_ERROR_PACKETS</displayName>
          <description>Rx CRC error packets register</description>
          <addressOffset>0x0794</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RXCRCERR</name>
              <description>Rx CRC Error Packets</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ETH_RX_ALIGNMENT_ERROR_PACKETS</name>
          <displayName>ETH_RX_ALIGNMENT_ERROR_PACKETS</displayName>
          <description>Rx alignment error packets register</description>
          <addressOffset>0x0798</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RXALGNERR</name>
              <description>Rx Alignment Error Packets</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ETH_RX_UNICAST_PACKETS_GOOD</name>
          <displayName>ETH_RX_UNICAST_PACKETS_GOOD</displayName>
          <description>Rx unicast packets good register</description>
          <addressOffset>0x07C4</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RXUCASTG</name>
              <description>Rx Unicast Packets Good</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ETH_TX_LPI_USEC_CNTR</name>
          <displayName>ETH_TX_LPI_USEC_CNTR</displayName>
          <description>Tx LPI microsecond timer register</description>
          <addressOffset>0x07EC</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TXLPIUSC</name>
              <description>Tx LPI Microseconds Counter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ETH_TX_LPI_TRAN_CNTR</name>
          <displayName>ETH_TX_LPI_TRAN_CNTR</displayName>
          <description>Tx LPI transition counter register</description>
          <addressOffset>0x07F0</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TXLPITRC</name>
              <description>Tx LPI Transition counter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ETH_RX_LPI_USEC_CNTR</name>
          <displayName>ETH_RX_LPI_USEC_CNTR</displayName>
          <description>Rx LPI microsecond counter register</description>
          <addressOffset>0x07F4</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RXLPIUSC</name>
              <description>Rx LPI Microseconds Counter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ETH_RX_LPI_TRAN_CNTR</name>
          <displayName>ETH_RX_LPI_TRAN_CNTR</displayName>
          <description>Rx LPI transition counter register</description>
          <addressOffset>0x07F8</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RXLPITRC</name>
              <description>Rx LPI Transition counter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ETH_MACL3L4C0R</name>
          <displayName>ETH_MACL3L4C0R</displayName>
          <description>L3 and L4 control 0 register</description>
          <addressOffset>0x0900</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>L3PEN0</name>
              <description>Layer 3 Protocol Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L3SAM0</name>
              <description>Layer 3 IP SA Match Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L3SAIM0</name>
              <description>Layer 3 IP SA Inverse Match Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L3DAM0</name>
              <description>Layer 3 IP DA Match Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L3DAIM0</name>
              <description>Layer 3 IP DA Inverse Match Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L3HSBM0</name>
              <description>Layer 3 IP SA higher bits match</description>
              <bitOffset>6</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0_IPV4_PACKETS</name>
                  <description>No bits are masked.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1_IPV4_PACKETS</name>
                  <description>LSb[0] is masked</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>L3HDBM0</name>
              <description>Layer 3 IP DA higher bits match</description>
              <bitOffset>11</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0_IPV4_PACKETS</name>
                  <description>No bits are masked.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1_IPV4_PACKETS</name>
                  <description>LSb[0] is masked</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>L4PEN0</name>
              <description>Layer 4 Protocol Enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L4SPM0</name>
              <description>Layer 4 Source Port Match Enable</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L4SPIM0</name>
              <description>Layer 4 Source Port Inverse Match Enable</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L4DPM0</name>
              <description>Layer 4 Destination Port Match Enable</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L4DPIM0</name>
              <description>Layer 4 Destination Port Inverse Match Enable</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ETH_MACL4A0R</name>
          <displayName>ETH_MACL4A0R</displayName>
          <description>Layer4 Address filter 0 register</description>
          <addressOffset>0x0904</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>L4SP0</name>
              <description>Layer 4 Source Port Number Field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L4DP0</name>
              <description>Layer 4 Destination Port Number Field</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ETH_MACL3A00R</name>
          <displayName>ETH_MACL3A00R</displayName>
          <description>Layer3 Address 0 filter 0 register</description>
          <addressOffset>0x0910</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>L3A00</name>
              <description>Layer 3 Address 0 Field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ETH_MACL3A10R</name>
          <displayName>ETH_MACL3A10R</displayName>
          <description>Layer3 Address 1 filter 0 register</description>
          <addressOffset>0x0914</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>L3A10</name>
              <description>Layer 3 Address 1 Field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ETH_MACL3A20R</name>
          <displayName>ETH_MACL3A20R</displayName>
          <description>Layer3 Address 2 filter 0 register</description>
          <addressOffset>0x0918</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>L3A20</name>
              <description>Layer 3 Address 2 Field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ETH_MACL3A30R</name>
          <displayName>ETH_MACL3A30R</displayName>
          <description>Layer3 Address 3 filter 0 register</description>
          <addressOffset>0x091C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>L3A30</name>
              <description>Layer 3 Address 3 Field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
