MaJerle/stm32-usart-uart-dma-rx-tx/drivers/CMSIS/Device/ST/STM32C5xx/SVD/STM32C593.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>USBSRAM</name>
      <description>USBSRAM address block description</description>
      <groupName>USBSRAM</groupName>
      <baseAddress>0x40016400</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x40</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>USBSRAM_CHEP_TXRXBD_0</name>
          <displayName>USBSRAM_CHEP_TXRXBD_0</displayName>
          <description>Channel/endpoint transmit buffer descriptor 0</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>ADDR_TX</name>
              <description>Transmission buffer address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COUNT_TX</name>
              <description>Transmission byte count</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USBSRAM_CHEP_TXRXBD_0_ALTERNATE1</name>
          <displayName>USBSRAM_CHEP_TXRXBD_0_ALTERNATE1</displayName>
          <description>Channel/endpoint receive buffer descriptor 0</description>
          <alternateRegister>USBSRAM_CHEP_TXRXBD_0</alternateRegister>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>ADDR_RX</name>
              <description>Reception buffer address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COUNT_RX</name>
              <description>Reception byte count</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NUM_BLOCK</name>
              <description>Number of blocks</description>
              <bitOffset>26</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BLSIZE</name>
              <description>Block size</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USBSRAM_CHEP_RXTXBD_0</name>
          <displayName>USBSRAM_CHEP_RXTXBD_0</displayName>
          <description>Channel/endpoint receive buffer descriptor 0</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>ADDR_RX</name>
              <description>Reception buffer address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COUNT_RX</name>
              <description>Reception byte count</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NUM_BLOCK</name>
              <description>Number of blocks</description>
              <bitOffset>26</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BLSIZE</name>
              <description>Block size</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USBSRAM_CHEP_RXTXBD_0_ALTERNATE1</name>
          <displayName>USBSRAM_CHEP_RXTXBD_0_ALTERNATE1</displayName>
          <description>Channel/endpoint transmit buffer descriptor 0</description>
          <alternateRegister>USBSRAM_CHEP_RXTXBD_0</alternateRegister>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>ADDR_TX</name>
              <description>Transmission buffer address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COUNT_TX</name>
              <description>Transmission byte count</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USBSRAM_CHEP_TXRXBD_1</name>
          <displayName>USBSRAM_CHEP_TXRXBD_1</displayName>
          <description>Channel/endpoint transmit buffer descriptor 1</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>ADDR_TX</name>
              <description>Transmission buffer address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COUNT_TX</name>
              <description>Transmission byte count</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USBSRAM_CHEP_TXRXBD_1_ALTERNATE1</name>
          <displayName>USBSRAM_CHEP_TXRXBD_1_ALTERNATE1</displayName>
          <description>Channel/endpoint receive buffer descriptor 1</description>
          <alternateRegister>USBSRAM_CHEP_TXRXBD_1</alternateRegister>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>ADDR_RX</name>
              <description>Reception buffer address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COUNT_RX</name>
              <description>Reception byte count</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NUM_BLOCK</name>
              <description>Number of blocks</description>
              <bitOffset>26</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BLSIZE</name>
              <description>Block size</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USBSRAM_CHEP_RXTXBD_1</name>
          <displayName>USBSRAM_CHEP_RXTXBD_1</displayName>
          <description>Channel/endpoint receive buffer descriptor 1</description>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>ADDR_RX</name>
              <description>Reception buffer address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COUNT_RX</name>
              <description>Reception byte count</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NUM_BLOCK</name>
              <description>Number of blocks</description>
              <bitOffset>26</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BLSIZE</name>
              <description>Block size</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USBSRAM_CHEP_RXTXBD_1_ALTERNATE1</name>
          <displayName>USBSRAM_CHEP_RXTXBD_1_ALTERNATE1</displayName>
          <description>Channel/endpoint transmit buffer descriptor 1</description>
          <alternateRegister>USBSRAM_CHEP_RXTXBD_1</alternateRegister>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>ADDR_TX</name>
              <description>Transmission buffer address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COUNT_TX</name>
              <description>Transmission byte count</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USBSRAM_CHEP_TXRXBD_2</name>
          <displayName>USBSRAM_CHEP_TXRXBD_2</displayName>
          <description>Channel/endpoint transmit buffer descriptor 2</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>ADDR_TX</name>
              <description>Transmission buffer address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COUNT_TX</name>
              <description>Transmission byte count</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USBSRAM_CHEP_TXRXBD_2_ALTERNATE1</name>
          <displayName>USBSRAM_CHEP_TXRXBD_2_ALTERNATE1</displayName>
          <description>Channel/endpoint receive buffer descriptor 2</description>
          <alternateRegister>USBSRAM_CHEP_TXRXBD_2</alternateRegister>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>ADDR_RX</name>
              <description>Reception buffer address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COUNT_RX</name>
              <description>Reception byte count</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NUM_BLOCK</name>
              <description>Number of blocks</description>
              <bitOffset>26</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BLSIZE</name>
              <description>Block size</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USBSRAM_CHEP_RXTXBD_2</name>
          <displayName>USBSRAM_CHEP_RXTXBD_2</displayName>
          <description>Channel/endpoint receive buffer descriptor 2</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>ADDR_RX</name>
              <description>Reception buffer address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COUNT_RX</name>
              <description>Reception byte count</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NUM_BLOCK</name>
              <description>Number of blocks</description>
              <bitOffset>26</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BLSIZE</name>
              <description>Block size</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USBSRAM_CHEP_RXTXBD_2_ALTERNATE1</name>
          <displayName>USBSRAM_CHEP_RXTXBD_2_ALTERNATE1</displayName>
          <description>Channel/endpoint transmit buffer descriptor 2</description>
          <alternateRegister>USBSRAM_CHEP_RXTXBD_2</alternateRegister>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>ADDR_TX</name>
              <description>Transmission buffer address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COUNT_TX</name>
              <description>Transmission byte count</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USBSRAM_CHEP_TXRXBD_3</name>
          <displayName>USBSRAM_CHEP_TXRXBD_3</displayName>
          <description>Channel/endpoint transmit buffer descriptor 3</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>ADDR_TX</name>
              <description>Transmission buffer address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COUNT_TX</name>
              <description>Transmission byte count</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USBSRAM_CHEP_TXRXBD_3_ALTERNATE1</name>
          <displayName>USBSRAM_CHEP_TXRXBD_3_ALTERNATE1</displayName>
          <description>Channel/endpoint receive buffer descriptor 3</description>
          <alternateRegister>USBSRAM_CHEP_TXRXBD_3</alternateRegister>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>ADDR_RX</name>
              <description>Reception buffer address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COUNT_RX</name>
              <description>Reception byte count</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NUM_BLOCK</name>
              <description>Number of blocks</description>
              <bitOffset>26</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BLSIZE</name>
              <description>Block size</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USBSRAM_CHEP_RXTXBD_3</name>
          <displayName>USBSRAM_CHEP_RXTXBD_3</displayName>
          <description>Channel/endpoint receive buffer descriptor 3</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>ADDR_RX</name>
              <description>Reception buffer address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COUNT_RX</name>
              <description>Reception byte count</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NUM_BLOCK</name>
              <description>Number of blocks</description>
              <bitOffset>26</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BLSIZE</name>
              <description>Block size</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USBSRAM_CHEP_RXTXBD_3_ALTERNATE1</name>
          <displayName>USBSRAM_CHEP_RXTXBD_3_ALTERNATE1</displayName>
          <description>Channel/endpoint transmit buffer descriptor 3</description>
          <alternateRegister>USBSRAM_CHEP_RXTXBD_3</alternateRegister>
          <addressOffset>0x1C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>ADDR_TX</name>
              <description>Transmission buffer address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COUNT_TX</name>
              <description>Transmission byte count</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USBSRAM_CHEP_TXRXBD_4</name>
          <displayName>USBSRAM_CHEP_TXRXBD_4</displayName>
          <description>Channel/endpoint transmit buffer descriptor 4</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>ADDR_TX</name>
              <description>Transmission buffer address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COUNT_TX</name>
              <description>Transmission byte count</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USBSRAM_CHEP_TXRXBD_4_ALTERNATE1</name>
          <displayName>USBSRAM_CHEP_TXRXBD_4_ALTERNATE1</displayName>
          <description>Channel/endpoint receive buffer descriptor 4</description>
          <alternateRegister>USBSRAM_CHEP_TXRXBD_4</alternateRegister>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>ADDR_RX</name>
              <description>Reception buffer address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COUNT_RX</name>
              <description>Reception byte count</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NUM_BLOCK</name>
              <description>Number of blocks</description>
              <bitOffset>26</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BLSIZE</name>
              <description>Block size</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
